Revit 2024 API
ParameterTypeId.PlumbingFixturesSupplyPipe Property
 "Supply Pipe"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId PlumbingFixturesSupplyPipe { get; }
Visual Basic
Public Shared ReadOnly Property PlumbingFixturesSupplyPipe As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PlumbingFixturesSupplyPipe {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace